---
kind: property
id: P:Autodesk.Revit.DB.SpatialElementTag.TagOrientation
source: html/710d99f6-e7eb-7254-d81c-392b18e9ddc6.htm
---
# Autodesk.Revit.DB.SpatialElementTag.TagOrientation Property

The orientation of the tag.

## Syntax (C#)
```csharp
public SpatialElementTagOrientation TagOrientation { get; set; }
```

## Remarks
See [!:Autodesk::Revit::DB::getSpatialElementTagOrientation] for the supported orientations.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration